{
  "91901": {
    "general_overview": "91901 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,050,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 18 units. The average time to sell is 60 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 21.6 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at 2 units."
  },
  "91902": {
    "general_overview": "91902 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,184,400, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 5 units. The average time to sell is 36 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 10.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $1,310,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. The average time to sell is 33 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 48.0 months of supply."
  },
  "91905": {
    "general_overview": "91905 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $562,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 7 units. The average time to sell is 45 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 42.0 months of supply.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "91906": {
    "general_overview": "91906 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $400,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 5 units. The average time to sell is 47 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 20.0 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory is non-existent with zero active listings, making new opportunities extremely rare."
  },
  "91910": {
    "general_overview": "91910 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $823,250, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 11 units. The average time to sell is 57 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 9.4 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $672,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 11 units. Homes are selling rapidly, averaging just 24 days on market. Current conditions point to a buyer's market with approx. 33.0 months of supply."
  },
  "91911": {
    "general_overview": "91911 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $783,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 13 units. The average time to sell is 44 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 10.4 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $590,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 13 units. The average time to sell is 46 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 31.2 months of supply."
  },
  "91913": {
    "general_overview": "91913 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,075,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 14 units. The average time to sell is 54 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 7.6 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $648,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 16 units. The average time to sell is 41 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 10.7 months of supply."
  },
  "91914": {
    "general_overview": "91914 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,325,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 1 units. Patience is key for sellers, with homes averaging 64 days to sell. Current conditions point to a seller's market with approx. 2.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $740,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. Patience is key for sellers, with homes averaging 66 days to sell. Current conditions point to a buyer's market with approx. 48.0 months of supply."
  },
  "91915": {
    "general_overview": "91915 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,035,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. The average time to sell is 39 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 4.4 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $695,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 10 units. The average time to sell is 41 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 17.1 months of supply."
  },
  "91916": {
    "general_overview": "91916 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $703,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. Patience is key for sellers, with homes averaging 110 days to sell. Current conditions point to a buyer's market with approx. 36.0 months of supply.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "91917": {
    "general_overview": "91917 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Transaction activity has been very quiet recently.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory levels are holding steady at None units.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "91931": {
    "general_overview": "91931 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Transaction activity has been very quiet recently.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory levels are holding steady at None units.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "91932": {
    "general_overview": "91932 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $765,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 8 units. Patience is key for sellers, with homes averaging 90 days to sell. Current conditions point to a buyer's market with approx. 12.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $715,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 14 units. Patience is key for sellers, with homes averaging 62 days to sell. Current conditions point to a buyer's market with approx. 168.0 months of supply."
  },
  "91934": {
    "general_overview": "91934 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Transaction activity has been very quiet recently.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory levels are holding steady at 1 units.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "91935": {
    "general_overview": "91935 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $894,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 8 units. Patience is key for sellers, with homes averaging 74 days to sell. Current conditions point to a buyer's market with approx. 16.0 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at None units."
  },
  "91941": {
    "general_overview": "91941 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,075,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 17 units. The average time to sell is 32 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 8.2 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $555,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 2 units. Patience is key for sellers, with homes averaging 174 days to sell. Current conditions point to a buyer's market with approx. 12.0 months of supply."
  },
  "91942": {
    "general_overview": "91942 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $934,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. Homes are selling rapidly, averaging just 15 days on market. Current conditions point to a balanced market with approx. 4.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $545,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. The average time to sell is 48 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 4.4 months of supply."
  },
  "91945": {
    "general_overview": "91945 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $750,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 1 units. Homes are selling rapidly, averaging just 19 days on market. Current conditions point to a extreme seller's market with approx. 1.7 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $349,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 16 units. Patience is key for sellers, with homes averaging 169 days to sell. Current conditions point to a buyer's market with approx. 192.0 months of supply."
  },
  "91948": {
    "general_overview": "91948 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Transaction activity has been very quiet recently.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory levels are holding steady at 1 units.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "91950": {
    "general_overview": "91950 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $732,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 2 units. The average time to sell is 39 days, indicative of a normal transaction pace. Current conditions point to a seller's market with approx. 2.7 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $397,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 7 units. Patience is key for sellers, with homes averaging 77 days to sell. Current conditions point to a buyer's market with approx. 42.0 months of supply."
  },
  "91962": {
    "general_overview": "91962 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $715,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 7 units. Patience is key for sellers, with homes averaging 64 days to sell. Current conditions point to a buyer's market with approx. 28.0 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at None units."
  },
  "91963": {
    "general_overview": "91963 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $450,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 1 units. Patience is key for sellers, with homes averaging 78 days to sell. Current conditions point to a buyer's market with approx. 12.0 months of supply.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "91977": {
    "general_overview": "91977 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $762,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 14 units. The average time to sell is 44 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 8.4 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $553,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 12 units. The average time to sell is 51 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 14.4 months of supply."
  },
  "91978": {
    "general_overview": "91978 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,046,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. Patience is key for sellers, with homes averaging 92 days to sell. Current conditions point to a buyer's market with approx. 12.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $485,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. Patience is key for sellers, with homes averaging 84 days to sell. Current conditions point to a buyer's market with approx. 9.0 months of supply."
  },
  "92003": {
    "general_overview": "92003 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $1,437,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 8 units. Patience is key for sellers, with homes averaging 140 days to sell. Current conditions point to a buyer's market with approx. 24.0 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at 2 units."
  },
  "92004": {
    "general_overview": "92004 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $470,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 23 units. Patience is key for sellers, with homes averaging 69 days to sell. Current conditions point to a buyer's market with approx. 92.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $340,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 12 units. Homes are selling rapidly, averaging just 23 days on market. Current conditions point to a buyer's market with approx. 144.0 months of supply."
  },
  "92007": {
    "general_overview": "92007 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $2,324,800, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. The average time to sell is 59 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 16.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $4,275,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. Patience is key for sellers, with homes averaging 77 days to sell. Current conditions point to a buyer's market with approx. 48.0 months of supply."
  },
  "92008": {
    "general_overview": "92008 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,630,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 16 units. Patience is key for sellers, with homes averaging 61 days to sell. Current conditions point to a buyer's market with approx. 13.7 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $2,022,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 18 units. Patience is key for sellers, with homes averaging 114 days to sell. Current conditions point to a buyer's market with approx. 21.6 months of supply."
  },
  "92009": {
    "general_overview": "92009 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,712,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 12 units. The average time to sell is 45 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 6.9 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $758,750, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 15 units. The average time to sell is 36 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 12.9 months of supply."
  },
  "92010": {
    "general_overview": "92010 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,740,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. The average time to sell is 39 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 6.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $824,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 2 units. Homes are selling rapidly, averaging just 10 days on market. Current conditions point to a buyer's market with approx. 6.0 months of supply."
  },
  "92011": {
    "general_overview": "92011 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $2,000,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 1 units. Homes are selling rapidly, averaging just 29 days on market. Current conditions point to a extreme seller's market with approx. 1.3 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $1,710,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 6 units. The average time to sell is 55 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 24.0 months of supply."
  },
  "92014": {
    "general_overview": "92014 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $3,955,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 21 units. Patience is key for sellers, with homes averaging 92 days to sell. Current conditions point to a buyer's market with approx. 42.0 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at 7 units."
  },
  "92019": {
    "general_overview": "92019 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $800,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 11 units. The average time to sell is 54 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 6.9 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $575,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 14 units. The average time to sell is 34 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 18.7 months of supply."
  },
  "92020": {
    "general_overview": "92020 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,060,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 9 units. The average time to sell is 34 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 4.5 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $440,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 15 units. Patience is key for sellers, with homes averaging 117 days to sell. Current conditions point to a buyer's market with approx. 30.0 months of supply."
  },
  "92021": {
    "general_overview": "92021 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $875,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 11 units. Homes are selling rapidly, averaging just 26 days on market. Current conditions point to a buyer's market with approx. 10.2 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $435,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 17 units. The average time to sell is 50 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 34.0 months of supply."
  },
  "92024": {
    "general_overview": "92024 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,888,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 38 units. The average time to sell is 42 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 17.5 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $1,605,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 15 units. The average time to sell is 55 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 16.4 months of supply."
  },
  "92025": {
    "general_overview": "92025 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $944,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 11 units. The average time to sell is 50 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 6.6 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $566,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 13 units. The average time to sell is 53 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 15.6 months of supply."
  },
  "92026": {
    "general_overview": "92026 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $885,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 29 units. The average time to sell is 38 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 15.1 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $479,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 9 units. The average time to sell is 50 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 10.8 months of supply."
  },
  "92027": {
    "general_overview": "92027 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $820,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 21 units. The average time to sell is 33 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 12.6 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $305,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 7 units. The average time to sell is 34 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 84.0 months of supply."
  },
  "92028": {
    "general_overview": "92028 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $874,250, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 67 units. The average time to sell is 55 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 18.3 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $597,250, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 5 units. Patience is key for sellers, with homes averaging 79 days to sell. Current conditions point to a buyer's market with approx. 10.0 months of supply."
  },
  "92029": {
    "general_overview": "92029 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,299,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 10 units. The average time to sell is 40 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 9.2 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at 1 units."
  },
  "92036": {
    "general_overview": "92036 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $529,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 32 units. Patience is key for sellers, with homes averaging 61 days to sell. Current conditions point to a buyer's market with approx. 76.8 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at 1 units."
  },
  "92037": {
    "general_overview": "92037 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $3,255,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 44 units. The average time to sell is 38 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 29.3 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $1,305,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 30 units. The average time to sell is 40 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 32.7 months of supply."
  },
  "92040": {
    "general_overview": "92040 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $815,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 8 units. Homes are selling rapidly, averaging just 25 days on market. Current conditions point to a buyer's market with approx. 8.7 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $322,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 6 units. The average time to sell is 59 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 36.0 months of supply."
  },
  "92054": {
    "general_overview": "92054 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,175,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 18 units. The average time to sell is 40 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 19.6 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $1,185,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 20 units. The average time to sell is 44 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 17.1 months of supply."
  },
  "92056": {
    "general_overview": "92056 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,000,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 15 units. The average time to sell is 35 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 7.8 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $577,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 15 units. The average time to sell is 33 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 10.0 months of supply."
  },
  "92057": {
    "general_overview": "92057 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $899,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 18 units. The average time to sell is 46 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 10.8 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $450,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 24 units. The average time to sell is 46 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 24.0 months of supply."
  },
  "92058": {
    "general_overview": "92058 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $995,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 5 units. Homes are selling rapidly, averaging just 24 days on market. Current conditions point to a buyer's market with approx. 20.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $510,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 2 units. Patience is key for sellers, with homes averaging 82 days to sell. Current conditions point to a buyer's market with approx. 8.0 months of supply."
  },
  "92059": {
    "general_overview": "92059 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Transaction activity has been very quiet recently.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory levels are holding steady at None units.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "92060": {
    "general_overview": "92060 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $310,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. The average time to sell is 48 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 36.0 months of supply.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "92061": {
    "general_overview": "92061 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $1,300,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 9 units. Patience is key for sellers, with homes averaging 67 days to sell. Current conditions point to a buyer's market with approx. 54.0 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at None units."
  },
  "92064": {
    "general_overview": "92064 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,775,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 20 units. Patience is key for sellers, with homes averaging 80 days to sell. Current conditions point to a buyer's market with approx. 14.1 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $890,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 5 units. Homes are selling rapidly, averaging just 6 days on market. Current conditions point to a buyer's market with approx. 60.0 months of supply."
  },
  "92065": {
    "general_overview": "92065 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $797,492, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 27 units. The average time to sell is 44 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 18.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $320,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 7 units. Patience is key for sellers, with homes averaging 134 days to sell. Current conditions point to a buyer's market with approx. 42.0 months of supply."
  },
  "92066": {
    "general_overview": "92066 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Transaction activity has been very quiet recently.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory levels are holding steady at 1 units.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "92067": {
    "general_overview": "92067 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $5,487,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 33 units. The average time to sell is 58 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 23.3 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at 3 units."
  },
  "92069": {
    "general_overview": "92069 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $935,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 16 units. The average time to sell is 34 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 19.2 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at 8 units."
  },
  "92071": {
    "general_overview": "92071 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $847,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 9 units. The average time to sell is 38 days, indicative of a normal transaction pace. Current conditions point to a seller's market with approx. 3.9 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $569,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 16 units. The average time to sell is 43 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 17.5 months of supply."
  },
  "92075": {
    "general_overview": "92075 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $3,925,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 8 units. Patience is key for sellers, with homes averaging 201 days to sell. Current conditions point to a buyer's market with approx. 96.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $1,450,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 2 units. Patience is key for sellers, with homes averaging 69 days to sell. Current conditions point to a buyer's market with approx. 6.0 months of supply."
  },
  "92078": {
    "general_overview": "92078 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,250,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady. The average time to sell is indicative of a normal transaction pace. Current conditions point to a balanced market.",
    "attached": "Prices in the condo/townhome sector have stabilized at $707,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady. The average time to sell is indicative of a normal transaction pace. Current conditions point to a balanced market."
  },
  "92081": {
    "general_overview": "92081 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $930,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. The average time to sell is 37 days, indicative of a normal transaction pace. Current conditions point to a seller's market with approx. 2.8 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $500,100, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 7 units. The average time to sell is 50 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 28.0 months of supply."
  },
  "92082": {
    "general_overview": "92082 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $865,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 21 units. Patience is key for sellers, with homes averaging 108 days to sell. Current conditions point to a buyer's market with approx. 22.9 months of supply.",
    "attached": "Insufficient data available for condo/townhome analysis."
  },
  "92083": {
    "general_overview": "92083 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $805,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 5 units. The average time to sell is 42 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 4.6 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $575,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. The average time to sell is 39 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 12.0 months of supply."
  },
  "92084": {
    "general_overview": "92084 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,060,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 16 units. The average time to sell is 44 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 6.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $737,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. Patience is key for sellers, with homes averaging 65 days to sell. Current conditions point to a buyer's market with approx. 12.0 months of supply."
  },
  "92086": {
    "general_overview": "92086 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Transaction activity has been very quiet recently.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory levels are holding steady at 3 units.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at None units."
  },
  "92091": {
    "general_overview": "92091 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory levels are holding steady at 2 units.",
    "attached": "Prices in the condo/townhome sector have stabilized at $1,550,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 1 units. The average time to sell is 51 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 4.0 months of supply."
  },
  "92101": {
    "general_overview": "92101 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory levels are holding steady at 3 units.",
    "attached": "Prices in the condo/townhome sector have stabilized at $772,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 86 units. The average time to sell is 60 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 36.9 months of supply."
  },
  "92102": {
    "general_overview": "92102 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $665,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 6 units. Homes are selling rapidly, averaging just 17 days on market. Current conditions point to a buyer's market with approx. 12.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $667,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. Homes are selling rapidly, averaging just 29 days on market. Current conditions point to a buyer's market with approx. 18.0 months of supply."
  },
  "92103": {
    "general_overview": "92103 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,816,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 12 units. Homes are selling rapidly, averaging just 18 days on market. Current conditions point to a buyer's market with approx. 16.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $995,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 12 units. Patience is key for sellers, with homes averaging 75 days to sell. Current conditions point to a buyer's market with approx. 16.0 months of supply."
  },
  "92104": {
    "general_overview": "92104 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,275,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 10 units. The average time to sell is 38 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 10.9 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $596,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. Homes are selling rapidly, averaging just 29 days on market. Current conditions point to a buyer's market with approx. 6.0 months of supply."
  },
  "92105": {
    "general_overview": "92105 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $785,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. The average time to sell is 30 days, indicative of a normal transaction pace. Current conditions point to a seller's market with approx. 3.3 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $480,600, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 13 units. The average time to sell is 33 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 13.0 months of supply."
  },
  "92106": {
    "general_overview": "92106 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,755,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 14 units. The average time to sell is 50 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 16.8 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $1,063,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. The average time to sell is 58 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 24.0 months of supply."
  },
  "92107": {
    "general_overview": "92107 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $2,175,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 10 units. The average time to sell is 37 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 10.9 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $874,250, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 7 units. Patience is key for sellers, with homes averaging 93 days to sell. Current conditions point to a buyer's market with approx. 21.0 months of supply."
  },
  "92108": {
    "general_overview": "92108 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory is non-existent with zero active listings, making new opportunities extremely rare.",
    "attached": "Prices in the condo/townhome sector have stabilized at $950,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 25 units. Patience is key for sellers, with homes averaging 61 days to sell. Current conditions point to a buyer's market with approx. 13.0 months of supply."
  },
  "92109": {
    "general_overview": "92109 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $2,237,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 23 units. The average time to sell is 38 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 19.7 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $926,250, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 20 units. The average time to sell is 31 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 14.1 months of supply."
  },
  "92110": {
    "general_overview": "92110 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,475,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 5 units. The average time to sell is 36 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 8.6 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $600,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 12 units. The average time to sell is 53 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 20.6 months of supply."
  },
  "92111": {
    "general_overview": "92111 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,100,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 6 units. Homes are selling rapidly, averaging just 9 days on market. Current conditions point to a buyer's market with approx. 6.5 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $750,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 8 units. The average time to sell is 43 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 5.3 months of supply."
  },
  "92113": {
    "general_overview": "92113 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $710,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. The average time to sell is 38 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 4.5 months of supply.",
    "attached": "Pricing data for condo/townhome properties is currently limited. Inventory levels are holding steady at 2 units."
  },
  "92114": {
    "general_overview": "92114 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $769,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 10 units. The average time to sell is 32 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 5.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $760,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 1 units. Homes are selling rapidly, averaging just 17 days on market. Current conditions point to a buyer's market with approx. 12.0 months of supply."
  },
  "92115": {
    "general_overview": "92115 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $874,950, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 15 units. The average time to sell is 56 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 7.5 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $487,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 21 units. The average time to sell is 46 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 31.5 months of supply."
  },
  "92116": {
    "general_overview": "92116 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,005,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 8 units. The average time to sell is 31 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 9.6 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $690,250, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 1 units. The average time to sell is 42 days, indicative of a normal transaction pace. Current conditions point to a seller's market with approx. 3.0 months of supply."
  },
  "92117": {
    "general_overview": "92117 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,350,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 11 units. The average time to sell is 35 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 4.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $889,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 9 units. The average time to sell is 36 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 15.4 months of supply."
  },
  "92118": {
    "general_overview": "92118 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $3,227,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 18 units. The average time to sell is 53 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 14.4 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $1,742,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 22 units. Patience is key for sellers, with homes averaging 89 days to sell. Current conditions point to a buyer's market with approx. 26.4 months of supply."
  },
  "92119": {
    "general_overview": "92119 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,050,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. The average time to sell is 30 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 4.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $465,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 2 units. The average time to sell is 43 days, indicative of a normal transaction pace. Current conditions point to a seller's market with approx. 3.0 months of supply."
  },
  "92120": {
    "general_overview": "92120 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,085,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 6 units. The average time to sell is 35 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 4.2 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $858,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 7 units. Patience is key for sellers, with homes averaging 148 days to sell. Current conditions point to a buyer's market with approx. 28.0 months of supply."
  },
  "92121": {
    "general_overview": "92121 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Pricing data for single-family properties is currently limited. Inventory levels are holding steady at 1 units.",
    "attached": "Prices in the condo/townhome sector have stabilized at $825,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 2 units. Homes are selling rapidly, averaging just 18 days on market. Current conditions point to a buyer's market with approx. 24.0 months of supply."
  },
  "92122": {
    "general_overview": "92122 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,685,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. Homes are selling rapidly, averaging just 10 days on market. Current conditions point to a balanced market with approx. 5.1 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $688,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 22 units. Patience is key for sellers, with homes averaging 78 days to sell. Current conditions point to a buyer's market with approx. 37.7 months of supply."
  },
  "92123": {
    "general_overview": "92123 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,025,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 8 units. Patience is key for sellers, with homes averaging 72 days to sell. Current conditions point to a buyer's market with approx. 16.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $680,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 5 units. The average time to sell is 46 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 20.0 months of supply."
  },
  "92124": {
    "general_overview": "92124 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $952,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 2 units. The average time to sell is 32 days, indicative of a normal transaction pace. Current conditions point to a seller's market with approx. 3.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $722,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 5 units. The average time to sell is 35 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 7.5 months of supply."
  },
  "92126": {
    "general_overview": "92126 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,182,833, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 14 units. The average time to sell is 45 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 11.2 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $663,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 17 units. The average time to sell is 44 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 17.0 months of supply."
  },
  "92127": {
    "general_overview": "92127 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,980,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 15 units. The average time to sell is 39 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 11.2 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $665,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 12 units. The average time to sell is 45 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 14.4 months of supply."
  },
  "92128": {
    "general_overview": "92128 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,082,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 15 units. Homes are selling rapidly, averaging just 29 days on market. Current conditions point to a buyer's market with approx. 6.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $670,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 27 units. The average time to sell is 46 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 14.1 months of supply."
  },
  "92129": {
    "general_overview": "92129 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,295,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 7 units. The average time to sell is 47 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 6.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $685,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 9 units. Patience is key for sellers, with homes averaging 95 days to sell. Current conditions point to a buyer's market with approx. 21.6 months of supply."
  },
  "92130": {
    "general_overview": "92130 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $2,301,259, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. The average time to sell is 55 days, indicative of a normal transaction pace. Current conditions point to a seller's market with approx. 2.6 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $988,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. The average time to sell is 58 days, indicative of a normal transaction pace. Current conditions point to a balanced market with approx. 4.4 months of supply."
  },
  "92131": {
    "general_overview": "92131 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $1,825,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. Homes are selling rapidly, averaging just 26 days on market. Current conditions point to a balanced market with approx. 5.3 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $760,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 9 units. Homes are selling rapidly, averaging just 26 days on market. Current conditions point to a buyer's market with approx. 18.0 months of supply."
  },
  "92139": {
    "general_overview": "92139 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $792,500, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 3 units. Homes are selling rapidly, averaging just 20 days on market. Current conditions point to a buyer's market with approx. 9.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $659,950, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 7 units. Homes are selling rapidly, averaging just 23 days on market. Current conditions point to a buyer's market with approx. 8.4 months of supply."
  },
  "92154": {
    "general_overview": "92154 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Market activity remains consistent.",
    "detached": "Prices in the single-family sector have stabilized at $810,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 6 units. Homes are selling rapidly, averaging just 29 days on market. Current conditions point to a seller's market with approx. 3.1 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $555,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 17 units. The average time to sell is 33 days, indicative of a normal transaction pace. Current conditions point to a buyer's market with approx. 18.5 months of supply."
  },
  "92173": {
    "general_overview": "92173 enters 2026 with a steady market environment, showing resilience despite broader economic shifts. Sales volume remains low, suggesting a pause in activity.",
    "detached": "Prices in the single-family sector have stabilized at $705,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 4 units. Patience is key for sellers, with homes averaging 167 days to sell. Current conditions point to a buyer's market with approx. 24.0 months of supply.",
    "attached": "Prices in the condo/townhome sector have stabilized at $410,000, reflecting a 0% shift year-over-year. Inventory levels are holding steady at 6 units. Homes are selling rapidly, averaging just 16 days on market. Current conditions point to a buyer's market with approx. 72.0 months of supply."
  }
}